{
    "version": "https://jsonfeed.org/version/1",
    "title": "kafeneio",
    "description": "",
    "home_page_url": "https://foufoutos.github.io/kafeneio",
    "feed_url": "https://foufoutos.github.io/kafeneio/feed.json",
    "user_comment": "",
    "author": {
        "name": "foufoutos"
    },
    "items": [
        {
            "id": "https://foufoutos.github.io/kafeneio/mastodonto-mastodon.html",
            "url": "https://foufoutos.github.io/kafeneio/mastodonto-mastodon.html",
            "title": "Μαστόδοντο Mastodon",
            "summary": "Λίγα βασικά πράγματα για το Μαστόδοντο και το Καφενείο kafeneio.social Το Μαστόδοντο έιναι μέρος του Fediverse ενός γιγάντιου δίκτυου υπηρεσιών κοινωνικής δικτύωσης. Υπάρχουν πλατφόρμες για microblogging, blogging, photoblogging, videohosting και πολλά άλλα και είναι όλες διασυνδεδεμένες ή ομοσπονδιοποιημένες. Έτσι, χρειάζεστε μόνο έναν λογαριασμό για να&hellip;",
            "content_html": "<p class=\"align-center\"><strong><span lang=\"el-GR\">Λίγα βασικά πράγματα για το Μαστόδοντο και το Καφενείο <a href=\"https://kafeneio.social\" title=\"Καφενείο, ένα Mastodon instance για Ελληνόφωνους και όχι μόνο\" target=\"_blank\" rel=\"noopener noreferrer\">kafeneio.social</a></span></strong></p>\n<p><span lang=\"el-GR\">Το Μαστόδοντο έιναι μέρος του Fediverse ενός γιγάντιου δίκτυου υπηρεσιών κοινωνικής δικτύωσης.</span></p>\n<p><span lang=\"el-GR\">Υπάρχουν πλατφόρμες για microblogging, blogging, photoblogging, videohosting και πολλά άλλα και είναι όλες διασυνδεδεμένες ή ομοσπονδιοποιημένες.<br>Έτσι, χρειάζεστε μόνο έναν λογαριασμό για να ακολουθήσετε χρήστες σε οποιαδήποτε από τις πλατφόρμες.<br></span>Φανταστείτε το Twitter, το Facebook, το Instagram να ήταν όλα μέρος ενός γιγαντιαίου δικτύου. Αυτό είναι ουσιαστικά το Fediverse, μόνο που οι πλατφόρμες του και οι servers του είναι λιγότερο γνωστά, είναι ελεύθερου λογισμικού και συγκροτούν μια ομοσπονδία, που δεν έχει ιδιοκτήτη<br>Στο Fediverse μπορείτε να χρησιμοποιήσετε το λογαριασμό σας στο \"Twitter\" για να αλληλεπιδράσετε με χρήστες του \"Facebook\", να μοιραστείτε αναρτήσεις του \"Instagram\", να σχολιάσετε κάτω από βίντεο του \"Youtube\", να ακούσετε μουσική του \"Bandcamp\", να ακολουθήσετε blogs του \"Blogger\", να λάβετε μέρος σε συζητήσεις του \"Reddit\" και πολλά άλλα. </p>\n<p>Περισσότερες πληροφορίες στο <a href=\"https://joinfediverse.wiki/What_is_the_Fediverse%3F\" target=\"_blank\" rel=\"noopener noreferrer\">wiki</a></p>\n<p>Το Μαστόδοντο ξεκίνησε ως μια πλατφόρμα microblogging παρόμοια με το Twitter, αλλά έχει εξελιχθεί με περισσότερα χαρακτηριστικά, που δείχνουν μια ηθική, προοδευτική και χωρίς αποκλεισμούς εστίαση. Έ<span lang=\"el-GR\">χει διαφορετική φιλοσοφία από το twitter, και δεν έχει κανενός είδους αλγόριθμο να καθορίζει τι βλέπεις. Βλέπεις όσα θέλεις, από όποιον θέλεις και </span><span lang=\"el-GR\">το Μαστόδοντο δεν θα σου κάνει καμία επιλογή στο ποια toots θα εμφανίζονται στο timeline σου.</span></p>\n<p>Αποτελείτε από πολλούς servers, τα λεγόμενα instances, ένα απ'αυτά είναι και το Καφενείο. Το συνολικό δίκτυο λειτουργεί χωρίς κεντρική διαχείριση, χωρίς ιδιοκτήτη και εθελοντικά.<br>Περισσότερες πληροφορίες <a href=\"https://joinmastodon.org/\" target=\"_blank\" rel=\"noopener noreferrer\">εδώ</a> και <a href=\"https://en.wikipedia.org/wiki/Mastodon_(software)\" target=\"_blank\" rel=\"noopener noreferrer\">εδώ</a></p>\n<p><span lang=\"el-GR\">Για να συμμετέχεις στο Μαστόδοντο και κατ' επέκταση σε όλο το Fediverse, πρέπει να εγγραφείς σε κάποιο instance (δηλαδή σε κάποιον σέρβερ) και εν προκειμένω στο <a href=\"https://kafeneio.social\" target=\"_blank\" rel=\"noopener noreferrer\">Καφενείο</a>.</span></p>\n<p><span style=\"text-decoration: underline;\"><strong>Απορίες και προβλήματα, που κατά καιρούς εκφράζουν οι νεοεισερχόμενοι:</strong></span></p>\n<p>1) <span style=\"text-decoration: underline;\">Πως μετακομίζω από ένα instance σε κάποιο άλλο;</span><br>Πρώτο βήμα στο παλιό instance:<br>Ρυθμίσεις --&gt; Εισαγωγή και Εξαγωγή --&gt; Εξαγωγή Δεδομένων --&gt; κάνεις κλικ όπου λέει CSV και κατεβάζεις τα αρχεία για backup. Επίσης πατάς \"Αιτήσου το Αρχείο σου\" και θα σου έρθει με μειλ.<br>Στη συνέχεια:<br>1. Εγγράψου σε έναν server<br>2. Στον ΝΕΟ server: Ρυθμίσεις --&gt; Λογαριασμός --&gt; Μεταφορά ΑΠΟ άλλον λογαριασμό<br>3. Εισήγαγε το διακριτικό του παλιού σου λογαριασμού + Δημιουργία Ψευδωνύμου<br>4. Στον ΠΑΛΙΟ λογαριασμό: Ρυθμίσεις --&gt; Λογαριασμός --&gt; Μετακόμιση ΣΕ άλλλον λογαριασμό<br>5. Εισήγαγε το διακριτικό του ΝΕΟΥ λογαριασμού και πάτησε υποβολή</p>\n<p><span style=\"text-decoration: underline;\">Ορολογίες:<br></span>toot, το κείμενο που γράφεις και δημοσιεύεις<br>(re)boost, η προώθηση ενός toot<br>quote toot, αυτή η δυνατότητα ΔΕΝ υπάρχει. Έχει γίνει πολλή συζήτηση, κάποια στιγμή θα την προσθέσω στο παρόν κείμενο</p>\n<p><span lang=\"el-GR\">Στο Μαστόδοντο έχεις στη διάθεσή σου 4 \"timelines\":<br></span><span lang=\"el-GR\">1) Το γενικό, αυτό με όσους ακολουθείς εσύ.<br>2) Τα </span><span lang=\"en-US\">notifications</span><span lang=\"el-GR\">.<br>3) Το τοπικό, δηλαδή όλα τα toots που γράφονται στο instance που συμμετέχεις.<br>4) Το συνολικό, δηλαδή όλα όσα γράφονται στο Fediverse</span><span lang=\"el-GR\">.</span></p>\n<p> </p>\n<p><br><br></p>",
            "author": {
                "name": "foufoutos"
            },
            "tags": [
            ],
            "date_published": "2022-11-02T21:32:48+02:00",
            "date_modified": "2022-11-02T21:32:48+02:00"
        }
    ]
}
